РазрешенияНаБСП24/src/InformationRegisters/УведомлениеПоОстаткамКвоты/УведомлениеПоОстаткамКвоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УведомлениеПоОстаткамКвоты</name>
  <resources>
    <name>МинимальныйОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НулевойОтстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Разрешение</name>
    <type>
      <types>DocumentRef.Разрешения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Образец</name>
    <type>
      <types>CatalogRef.Образцы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбразца</name>
    <type>
      <types>EnumRef.ТипыОбразцов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РазрешенияНаБСП24/src/AccumulationRegisters/ОстаткиПоКвоте/ОстаткиПоКвоте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПоКвоте</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Образец</name>
    <type>
      <types>CatalogRef.Образцы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбразца</name>
    <type>
      <types>EnumRef.ТипыОбразцов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрешение</name>
    <type>
      <types>DocumentRef.Разрешения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

РазрешенияНаБСП24/src/Documents/Разрешения/Разрешения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Разрешения</name>
  <registerRecords>AccumulationRegister.ОстаткиПоКвоте</registerRecords>
  <attributes>
    <name>SenderCRO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReceiverLAB</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ПринимающаяЛаборатория</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegisatrationLetterNr</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Valid</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrialPermit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StudyNumber</name>
    <type>
      <types>CatalogRef.Протоколы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ambient</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Frozen</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Chilled</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Requesters</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Closed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредупреждения</name>
    <type>
      <types>EnumRef.ТипыПредупреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ClearanceДепо</name>
    <type>
      <types>EnumRef.ClearanceДепо</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписант</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Города</name>
    <attributes>
      <name>Город</name>
      <type>
        <types>CatalogRef.Города</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образцы</name>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.Образцы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбразца</name>
      <type>
        <types>EnumRef.ТипыОбразцов</types>
      </type>
    </attributes>
    <attributes>
      <name>Квота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстаток</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НулевойОстаток</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РазрешенияНаБСП24/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <predefined>
    <items>
      <name>СистемнаяУчетнаяЗаписьЭлектроннойПочты</name>
      <description>Системная учетная запись</description>
    </items>
  </predefined>
  <attributes>
    <name>SMTPАутентификация</name>
    <type>
      <types>EnumRef.ВариантыSMTPАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезопасныйВходНаСерверВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезопасныйВходНаСерверИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодХраненияСообщенийНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераВходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособPOP3Аутентификации</name>
    <type>
      <types>EnumRef.СпособыPOP3Аутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособSMTPАутентификации</name>
    <type>
      <types>EnumRef.СпособыSMTPАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходНаСерверПередОтправкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВПредставлениеВключатьИмяПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственныйЗаОбработкуПисем</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПарольSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

РазрешенияНаБСП24/src/CommonModules/РаботаСПочтовымиСообщениямиРазрешения1С/Module.bsl
Процедура ОтправитьУведомлениеОНулевомОстатке(Документ = Неопределено) Экспорт 
	
	Тема = "Автоматическое уведомление о нулевом остатке образцов по разрешениям";
	ЗаголовокТекста = "Достигнут нулевой остаток по следующим образцам:" + Символы.ПС;
	ОсновнойТекстПисьма = "";

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РазрешенияОбразцы.НомерСтроки,
	               |	УведомлениеПоОстаткамКвоты.Разрешение,
	               |	УведомлениеПоОстаткамКвоты.Образец,
	               |	УведомлениеПоОстаткамКвоты.ТипОбразца,
	               |	ЕСТЬNULL(ОстаткиПоКвотеОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ВТ_ОстаткиПоОбразцам
	               |ИЗ
	               |	РегистрСведений.УведомлениеПоОстаткамКвоты КАК УведомлениеПоОстаткамКвоты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПоКвоте.Остатки(&Период, ) КАК ОстаткиПоКвотеОстатки
	               |		ПО УведомлениеПоОстаткамКвоты.Разрешение = ОстаткиПоКвотеОстатки.Разрешение
	               |			И УведомлениеПоОстаткамКвоты.Образец = ОстаткиПоКвотеОстатки.Образец
	               |			И УведомлениеПоОстаткамКвоты.ТипОбразца = ОстаткиПоКвотеОстатки.ТипОбразца
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Разрешения.Образцы КАК РазрешенияОбразцы
	               |		ПО УведомлениеПоОстаткамКвоты.Разрешение = РазрешенияОбразцы.Ссылка
	               |			И УведомлениеПоОстаткамКвоты.Образец = РазрешенияОбразцы.Образец
	               |			И УведомлениеПоОстаткамКвоты.ТипОбразца = РазрешенияОбразцы.ТипОбразца
				   |ГДЕ
				   |	НЕ УведомлениеПоОстаткамКвоты.НулевойОтстаток
				   |	//ОтборПоДокументу
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПоОбразцам.Разрешение КАК Разрешение,
	               |	ПРЕДСТАВЛЕНИЕ(ВТ_ОстаткиПоОбразцам.Разрешение) КАК ПредставлениеРазрешение,
	               |	ВТ_ОстаткиПоОбразцам.НомерСтроки,
	               |	ВТ_ОстаткиПоОбразцам.Образец,
	               |	ПРЕДСТАВЛЕНИЕ(ВТ_ОстаткиПоОбразцам.Образец) КАК ПредставлениеОбразец,
	               |	ВТ_ОстаткиПоОбразцам.ТипОбразца
	               |ИЗ
	               |	ВТ_ОстаткиПоОбразцам КАК ВТ_ОстаткиПоОбразцам
	               |ГДЕ
	               |	ВТ_ОстаткиПоОбразцам.КоличествоОстаток = 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Разрешение
	               |ИТОГИ ПО
	               |	Разрешение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ОстаткиПоОбразцам";
				   
	Если Не Документ = Неопределено Тогда
	     СписокРазрешений = Документ.Разрешения.ВыгрузитьКолонку("Разрешение");
		 Запрос.УстановитьПараметр("Период", Документ.МоментВремени());
		 Запрос.УстановитьПараметр("СписокРазрешений", СписокРазрешений);
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ОтборПоДокументу", "И УведомлениеПоОстаткамКвоты.Разрешение В(&СписокРазрешений)");
	КонецЕсли; 			   
				   
	Запрос.Текст = ТекстЗапроса;			   
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРазрешение = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаРазрешение.Следующий() Цикл
	    ОсновнойТекстПисьма = ОсновнойТекстПисьма + ВыборкаРазрешение.ПредставлениеРазрешение + ":" + Символы.ПС; 
		ВыборкаДетальныеЗаписи = ВыборкаРазрешение.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОсновнойТекстПисьма = ОсновнойТекстПисьма + Символы.Таб + ВыборкаДетальныеЗаписи.НомерСтроки + ". образец: " + ВыборкаДетальныеЗаписи.ПредставлениеОбразец + "/ тип: " + ВыборкаДетальныеЗаписи.ТипОбразца + "/ количество остаток: 0" + Символы.ПС;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОсновнойТекстПисьма) Тогда
		
		ТекстПисьма = ЗаголовокТекста + ОсновнойТекстПисьма;
		СистемнаяУчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		
		ДоступныеУчетныеЗаписи = РаботаСПочтовымиСообщениями.ДоступныеУчетныеЗаписи(Истина,,Ложь);
		Если ДоступныеУчетныеЗаписи.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Не обнаружены доступные учетные записи электронной почты, обратитесь к администратору системы.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		//ОтправитьПочтовоеСообщение
		ПараметрыПисьма = СформироватьПараметрыПисьма(Тема, ТекстПисьма, ДоступныеУчетныеЗаписи);
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыПисьма);
		
	КонецЕсли; 

КонецПроцедуры

Процедура ОтправитьУведомлениеОМинимальномОстаткеПоКвоте() Экспорт 
	
	Тема = "Автоматическое уведомление о минимальном остатке образцов по разрешениям";
	ЗаголовокТекста = "Достигнут минимальный остаток по следующим образцам:" + Символы.ПС;
	ОсновнойТекстПисьма = "";

	МинимальныйПроцентныйОстаток = Константы.МинимальныйПроцентныйОстатокОбразца.Получить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МинимальныйПроцентныйОстаток", МинимальныйПроцентныйОстаток);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.Текст = "ВЫБРАТЬ
	               |	УведомлениеПоОстаткамКвоты.Разрешение,
	               |	ОстаткиПоКвотеОстаткиИОбороты.НомерСтроки,
	               |	УведомлениеПоОстаткамКвоты.Образец,
	               |	УведомлениеПоОстаткамКвоты.ТипОбразца,
	               |	ЕСТЬNULL(ОстаткиПоКвотеОстаткиИОбороты.КоличествоПриход, 0) КАК РазмерКвоты
	               |ПОМЕСТИТЬ ВТ_РазмерКвоты
	               |ИЗ
	               |	РегистрСведений.УведомлениеПоОстаткамКвоты КАК УведомлениеПоОстаткамКвоты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПоКвоте.ОстаткиИОбороты(, , Запись, , ) КАК ОстаткиПоКвотеОстаткиИОбороты
	               |		ПО УведомлениеПоОстаткамКвоты.Разрешение = ОстаткиПоКвотеОстаткиИОбороты.Разрешение
	               |			И УведомлениеПоОстаткамКвоты.Образец = ОстаткиПоКвотеОстаткиИОбороты.Образец
	               |			И УведомлениеПоОстаткамКвоты.ТипОбразца = ОстаткиПоКвотеОстаткиИОбороты.ТипОбразца
	               |			И УведомлениеПоОстаткамКвоты.Разрешение = ОстаткиПоКвотеОстаткиИОбороты.Регистратор
	               |ГДЕ
	               |	НЕ УведомлениеПоОстаткамКвоты.МинимальныйОстаток
	               |	И НЕ УведомлениеПоОстаткамКвоты.НулевойОтстаток
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УведомлениеПоОстаткамКвоты.Разрешение,
	               |	УведомлениеПоОстаткамКвоты.Образец,
	               |	УведомлениеПоОстаткамКвоты.ТипОбразца,
	               |	ЕСТЬNULL(ОстаткиПоКвотеОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ВТ_ОстаткиПоОбразцам
	               |ИЗ
	               |	РегистрСведений.УведомлениеПоОстаткамКвоты КАК УведомлениеПоОстаткамКвоты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПоКвоте.Остатки(, ) КАК ОстаткиПоКвотеОстатки
	               |		ПО УведомлениеПоОстаткамКвоты.Разрешение = ОстаткиПоКвотеОстатки.Разрешение
	               |			И УведомлениеПоОстаткамКвоты.Образец = ОстаткиПоКвотеОстатки.Образец
	               |			И УведомлениеПоОстаткамКвоты.ТипОбразца = ОстаткиПоКвотеОстатки.ТипОбразца
	               |ГДЕ
	               |	НЕ УведомлениеПоОстаткамКвоты.МинимальныйОстаток
	               |	И НЕ УведомлениеПоОстаткамКвоты.НулевойОтстаток
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПоОбразцам.Разрешение,
	               |	ВТ_РазмерКвоты.НомерСтроки,
	               |	ВТ_ОстаткиПоОбразцам.Образец,
	               |	ВТ_ОстаткиПоОбразцам.ТипОбразца,
	               |	ВТ_ОстаткиПоОбразцам.КоличествоОстаток,
	               |	ВЫБОР
	               |		КОГДА ВТ_ОстаткиПоОбразцам.КоличествоОстаток = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ВТ_ОстаткиПоОбразцам.КоличествоОстаток / ВТ_РазмерКвоты.РазмерКвоты * 100
	               |	КОНЕЦ КАК ПроцентныйОстаток
	               |ПОМЕСТИТЬ ВТ_ПроцентныйОстаток
	               |ИЗ
	               |	ВТ_ОстаткиПоОбразцам КАК ВТ_ОстаткиПоОбразцам
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_РазмерКвоты КАК ВТ_РазмерКвоты
	               |		ПО ВТ_ОстаткиПоОбразцам.Разрешение = ВТ_РазмерКвоты.Разрешение
	               |			И ВТ_ОстаткиПоОбразцам.Образец = ВТ_РазмерКвоты.Образец
	               |			И ВТ_ОстаткиПоОбразцам.ТипОбразца = ВТ_РазмерКвоты.ТипОбразца
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПроцентныйОстаток.Разрешение КАК Разрешение,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_ПроцентныйОстаток.Разрешение) КАК ПредставлениеРазрешение,
	               |	ВТ_ПроцентныйОстаток.НомерСтроки КАК НомерСтроки,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_ПроцентныйОстаток.Образец) КАК ПредставлениеОбразец,
	               |	ВТ_ПроцентныйОстаток.ТипОбразца,
	               |	ВТ_ПроцентныйОстаток.КоличествоОстаток
	               |ИЗ
	               |	ВТ_ПроцентныйОстаток КАК ВТ_ПроцентныйОстаток
	               |ГДЕ
	               |	ВТ_ПроцентныйОстаток.ПроцентныйОстаток <= &МинимальныйПроцентныйОстаток
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Разрешение,
	               |	НомерСтроки
	               |ИТОГИ ПО
	               |	Разрешение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_РазмерКвоты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ОстаткиПоОбразцам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ПроцентныйОстаток";
				   
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРазрешение = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаРазрешение.Следующий() Цикл
	    ОсновнойТекстПисьма = ОсновнойТекстПисьма + ВыборкаРазрешение.ПредставлениеРазрешение + ":" + Символы.ПС; 
		ВыборкаДетальныеЗаписи = ВыборкаРазрешение.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОсновнойТекстПисьма = ОсновнойТекстПисьма + Символы.Таб + ВыборкаДетальныеЗаписи.НомерСтроки + ". образец: " + ВыборкаДетальныеЗаписи.ПредставлениеОбразец + "/ тип: " + ВыборкаДетальныеЗаписи.ТипОбразца + "/ количество остаток: " + ВыборкаДетальныеЗаписи.КоличествоОстаток + Символы.ПС;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОсновнойТекстПисьма) Тогда
		
		ТекстПисьма = ЗаголовокТекста + ОсновнойТекстПисьма;
		СистемнаяУчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		
		ДоступныеУчетныеЗаписи = РаботаСПочтовымиСообщениями.ДоступныеУчетныеЗаписи(Истина,,Ложь);
		Если ДоступныеУчетныеЗаписи.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Не обнаружены доступные учетные записи электронной почты, обратитесь к администратору системы.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		//ОтправитьПочтовоеСообщение
		ПараметрыПисьма = СформироватьПараметрыПисьма(Тема, ТекстПисьма, ДоступныеУчетныеЗаписи);
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыПисьма);
		
	КонецЕсли; 

КонецПроцедуры

Процедура ОтправитьУведомлениеОбОкончанииСрокаДействия() Экспорт
	
	Тема = "Автоматическое уведомление об окончании срока действия разрешений";
	ЗаголовокТекстаЧасть1 = "Окончен срок действия по разрешениям:" + Символы.ПС;
	ЗаголовокТекстаЧасть2 = "Близется срок окончания действия по разрешениям:" + Символы.ПС;
	ОсновнойТекстПисьмаЧасть1 = "";
	ОсновнойТекстПисьмаЧасть2 = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	Запрос.Текст = "ВЫБРАТЬ
	               |	Разрешения.Ссылка КАК ДокументРазрешение,
	               |	ПРЕДСТАВЛЕНИЕ(Разрешения.Ссылка) КАК ПредставлениеРазрешение,
	               |	Разрешения.Valid,
	               |	ВЫБОР
	               |		КОГДА Разрешения.Valid = &ТекущаяДата
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Closed
	               |ИЗ
	               |	Документ.Разрешения КАК Разрешения
	               |ГДЕ
	               |	(Разрешения.Valid = &ТекущаяДата
	               |			ИЛИ Разрешения.Valid = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 14))
	               |	И НЕ Разрешения.Closed
	               |	И Разрешения.Проведен";
				   
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Closed Тогда	 
			ОсновнойТекстПисьмаЧасть1 = ОсновнойТекстПисьмаЧасть1 + Выборка.ПредставлениеРазрешение + ";" + Символы.ПС;
			ДокументОбъект = Выборка.ДокументРазрешение.ПолучитьОбъект();
			ДокументОбъект.Closed = Выборка.Closed;
			ДокументОбъект.ТипПредупреждения = ПредопределенноеЗначение("Перечисление.ТипыПредупреждения.ПустаяСсылка"); 
			ДокументОбъект.Записать();
		Иначе
			ОсновнойТекстПисьмаЧасть2 = ОсновнойТекстПисьмаЧасть2 + Выборка.ПредставлениеРазрешение + ";" + Символы.ПС;
		КонецЕсли;
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ОсновнойТекстПисьмаЧасть1) Тогда
		ТекстПисьмаЧасть1 = ЗаголовокТекстаЧасть1 + ОсновнойТекстПисьмаЧасть1;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОсновнойТекстПисьмаЧасть2) Тогда
		ТекстПисьмаЧасть2 = ЗаголовокТекстаЧасть2 + ОсновнойТекстПисьмаЧасть2;
	КонецЕсли; 
	
	ТекстПисьма = ТекстПисьмаЧасть1 + ТекстПисьмаЧасть2;
	
	Если ЗначениеЗаполнено(ТекстПисьма) Тогда
	
		СистемнаяУчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		
		ДоступныеУчетныеЗаписи = РаботаСПочтовымиСообщениями.ДоступныеУчетныеЗаписи(Истина,,Ложь);
		Если ДоступныеУчетныеЗаписи.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Не обнаружены доступные учетные записи электронной почты, обратитесь к администратору системы.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		//ОтправитьПочтовоеСообщение
		ПараметрыПисьма = СформироватьПараметрыПисьма(Тема, ТекстПисьма, ДоступныеУчетныеЗаписи);
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыПисьма);
		
	КонецЕсли; 

КонецПроцедуры

// Проверяет возможность отправления письма и если
// это возможно - формирует параметры отправки.
//
Функция СформироватьПараметрыПисьма(Тема, ТекстПисьма, ПочтовыйАдресаПолучателей)
	
	ПараметрыПисьма = Новый Структура;
	Кому = Новый Массив;
	ТелоПисьма = Новый ФорматированныйДокумент;
	ВложенияДляПисьма = Новый Структура;
	
	Для каждого Получатель Из ПочтовыйАдресаПолучателей Цикл
		Если СтрНайти(Получатель.Адрес, "@") = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Неверный адрес электронной почты'"),, "ПочтовыйАдресаПолучателей[" + Формат(ПочтовыйАдресаПолучателей.Индекс(Получатель), "ЧГ=0") + "].Адрес");
			Результат = Ложь;
		КонецЕсли;
		Кому.Добавить(Новый Структура("Адрес, Представление", Получатель.Адрес, Получатель.Ссылка.ИмяПользователя));
	КонецЦикла;
	
	ПараметрыПисьма.Вставить("Кому",		Кому);
	ПараметрыПисьма.Вставить("Тема",		Тема);
	ПараметрыПисьма.Вставить("Тело",		ТекстПисьма);
	ПараметрыПисьма.Вставить("ТипТекста",	ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.ПростойТекст"));
	ПараметрыПисьма.Вставить("Важность",	ВажностьИнтернетПочтовогоСообщения.Наивысшая);
	
	Возврат ПараметрыПисьма;
	
КонецФункции
